* Capturing output from processes in Emacs


cite:aarik-1997-effec-tio2

** Shell command to string					   :noexport:
#+BEGIN_SRC emacs-lisp
(shell-command-to-string "pdflatex -shell-escape processes")
#+END_SRC

#+RESULTS:
#+begin_example
This is pdfTeX, Version 3.1415926-2.4-1.40.13 (MiKTeX 2.9)
entering extended mode

(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.tex
LaTeX2e <2011/06/27>
Babel <v3.8m> and hyphenation patterns for english, afrikaans, ancientgreek, ar
abic, armenian, assamese, basque, bengali, bokmal, bulgarian, catalan, coptic, 
croatian, czech, danish, dutch, esperanto, estonian, farsi, finnish, french, ga
lician, german, german-x-2012-05-30, greek, gujarati, hindi, hungarian, iceland
ic, indonesian, interlingua, irish, italian, kannada, kurmanji, latin, latvian,
 lithuanian, malayalam, marathi, mongolian, mongolianlmc, monogreek, ngerman, n
german-x-2012-05-30, nynorsk, oriya, panjabi, pinyin, polish, portuguese, roman
ian, russian, sanskrit, serbian, slovak, slovenian, spanish, swedish, swissgerm
an, tamil, telugu, turkish, turkmen, ukenglish, ukrainian, uppersorbian, usengl
ishmax, welsh, loaded.
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\article.cls"
Document Class: article 2007/10/19 v1.4h Standard LaTeX document class
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\size11.clo"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\inputenc.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\latin1.def"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\lm\lmodern.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\fontenc.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\t1enc.def"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\fixltx2e.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\graphics\graphicx.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\graphics\keyval.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\graphics\graphics.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\graphics\trig.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\00miktex\graphics.cfg")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\pdftex-def\pdftex.def"
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\infwarerr.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\ltxcmds.sty"))))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\tools\longtable.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\float\float.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\wrapfig\wrapfig.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\rotating\rotating.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\ifthen.sty"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\ulem\ulem.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsmath\amsmath.sty"
For additional information on amsmath, use the `?' option.
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsmath\amstext.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsmath\amsgen.sty"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsmath\amsbsy.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsmath\amsopn.sty"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\textcomp.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\ts1enc.def"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\marvosym\marvosym.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\wasysym\wasysym.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsfonts\amssymb.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsfonts\amsfonts.sty"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\mhchem\mhchem.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\tools\calc.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\oberdiek\twoopt.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\pdftexcmds.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\ifluatex.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\ifpdf.sty")))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\natbib\natbib.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\achemso\natmove.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\ltxmisc\url.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\minted\minted.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\fancyvrb\fancyvrb.sty"
Style option: `fancyvrb' v2.7a, with DG/SPQR fixes, and firstline=lastline fix 
<2008/02/07> (tvz))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\xcolor\xcolor.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\00miktex\color.cfg"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\ifplatform\ifplatform.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\catchfile.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\etexcmds.sty"))))Could Not Find c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\processes.aex

c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes>set  /p x=c:\Users\jkitchin\AppData\Local\Enthought\Canopy\User\Scripts\pygmentize.exe 0<nul: 1>>processes.aex 

c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes>set  /p x= 0<nul: 1>>processes.aex 

c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes>set  /p x= 0<nul: 1>>processes.aex 

file deleted
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\underscore\underscore.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\hyperref\hyperref.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\hobsub-hyperref.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\hobsub-generic.sty"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\ifxetex\ifxetex.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\oberdiek\auxhook.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\oberdiek\kvoptions.sty")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\hyperref\pd1enc.def")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\00miktex\hyperref.cfg"))

Package hyperref Message: Driver (autodetected): hpdftex.

("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\hyperref\hpdftex.def"
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\oberdiek\rerunfilecheck.sty"))
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\attachfile\attachfile.sty")
(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.aux) ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\ts1cmr.fd")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\lm\t1lmr.fd")
("C:\Program Files (x86)\MiKTeX 2.9\tex\context\base\supp-pdf.mkii"
[Loading MPS to PDF converter (version 2006.09.02).]
)
(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.pyg) ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\hyperref\nameref.sty"
("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\gettitlestring.sty"))
(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.out)
(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.out)
(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.toc) ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\lm\ot1lmr.fd")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\lm\omllmm.fd")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\lm\omslmsy.fd")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\lm\omxlmex.fd")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\wasysym\uwasy.fd")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsfonts\umsa.fd")
("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsfonts\umsb.fd")
(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.out.pyg ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\lm\t1lmtt.fd"))
Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_
blog\processes\proces[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Babel <v3.8m> and hyphenation patterns for english, afrika
ans, ancientgreek, ar[] 

Overfull \hbox (88.40121pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 abic, armenian, assamese, basque, bengali, bokmal, bulgari
an, catalan, coptic,[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 croatian, czech, danish, dutch, esperanto, estonian, farsi
, finnish, french, ga[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 lician, german, german-x-2012-05-30, greek, gujarati, hind
i, hungarian, iceland[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ic, indonesian, interlingua, irish, italian, kannada, kurm
anji, latin, latvian,[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[] \T1/lmtt/m/n/10.95 lithuanian, malayalam, marathi, mongolian, mongolianlmc, 
monogreek, ngerman, n[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 german-x-2012-05-30, nynorsk, oriya, panjabi, pinyin, poli
sh, portuguese, roman[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ian, russian, sanskrit, serbian, slovak, slovenian, spanis
h, swedish, swissgerm[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 an, tamil, telugu, turkish, turkmen, ukenglish, ukrainian,
 uppersorbian, usengl[] 

Overfull \hbox (2.17021pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\article
.cls"[] 

Overfull \hbox (42.41135pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Document Class: article 2007/10/19 v1.4h Standard LaTeX do
cument class[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\size11.
clo"))[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\inputen
c.sty"[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\latin1.
def"))[] 

Overfull \hbox (2.17021pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\fontenc
.sty"[] 

Overfull \hbox (2.17021pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\t1enc.d
ef"))[] 

Overfull \hbox (13.66768pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\fixltx2
e.sty")[] 

Overfull \hbox (30.91388pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\graphics\gra
phicx.sty"[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\graphics\key
val.sty")[] 

Overfull \hbox (30.91388pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\graphics\gra
phics.sty"[] 

Overfull \hbox (13.66768pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\graphics\tri
g.sty")[] 

Overfull \hbox (36.66261pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\00miktex\gra
phics.cfg")[] 

Overfull \hbox (30.91388pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\pdftex-def\p
dftex.def"[] 
[1{C:/ProgramData/MiKTeX/2.9/pdftex/config/pdftex.map}]
Overfull \hbox (53.90881pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\i
nfwarerr.sty")[] 

Overfull \hbox (59.65755pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\l
txcmds.sty"))))[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\tools\longta
ble.sty")[] 

Overfull \hbox (2.17021pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\float\float.
sty")[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\wrapfig\wrap
fig.sty")[] 

Overfull \hbox (30.91388pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\rotating\rot
ating.sty"[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\ifthen.
sty"))[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsmath\amsm
ath.sty"[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsmath\amst
ext.sty"[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsmath\amsg
en.sty"))[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsmath\amsb
sy.sty")[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsmath\amso
pn.sty"))[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\textcom
p.sty"[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\base\ts1enc.
def"))[] 

Overfull \hbox (36.66261pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\marvosym\mar
vosym.sty")[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\wasysym\wasy
sym.sty")[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsfonts\ams
symb.sty"[] 

Overfull \hbox (42.41135pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsfonts\ams
fonts.sty"))[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\mhchem\mhche
m.sty"[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\oberdiek\two
opt.sty")[] 

Overfull \hbox (53.90881pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\p
dftexcmds.sty"[] 

Overfull \hbox (48.16008pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\i
fluatex.sty")[] 

Overfull \hbox (42.41135pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\i
fpdf.sty")))[] 

Overfull \hbox (13.66768pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\natbib\natbi
b.sty")[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\achemso\natm
ove.sty")[] 

Overfull \hbox (2.17021pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\ltxmisc\url.
sty")[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\minted\minte
d.sty"[] 

Overfull \hbox (30.91388pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\fancyvrb\fan
cyvrb.sty"[] 

Overfull \hbox (88.40121pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Style option: `fancyvrb' v2.7a, with DG/SPQR fixes, and fi
rstline=lastline fix[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\xcolor\xcolo
r.sty"[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\00miktex\col
or.cfg"))[] 

Overfull \hbox (53.90881pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\ifplatform\i
fplatform.sty"[] 

Overfull \hbox (48.16008pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\c
atchfile.sty"[] 

Overfull \hbox (640.27963pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\e
texcmds.sty"))))Could Not Find c:\Users\jkitchin\Dropbox\blogofile-jkitchin.git
hub.com\_blog\processes\processes.aex[] 
[2]
Overfull \hbox (686.2695pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_b
log\processes>set  /p x=c:\Users\jkitchin\AppData\Local\Enthought\Canopy\User\S
cripts\pygmentize.exe 0<nul: 1>>processes.aex[] 

Overfull \hbox (249.36575pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_b
log\processes>set  /p x= 0<nul: 1>>processes.aex[] 

Overfull \hbox (249.36575pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_b
log\processes>set  /p x= 0<nul: 1>>processes.aex[] 

Overfull \hbox (59.65755pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\underscore\u
nderscore.sty")[] 

Overfull \hbox (30.91388pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\hyperref\hyp
erref.sty"[] 

Overfull \hbox (82.65248pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\h
obsub-hyperref.sty"[] 

Overfull \hbox (88.40121pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\h
obsub-generic.sty"))[] 

Overfull \hbox (36.66261pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\ifxetex\if
xetex.sty")[] 

Overfull \hbox (30.91388pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\oberdiek\aux
hook.sty")[] 

Overfull \hbox (42.41135pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\oberdiek\kvo
ptions.sty")[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\hyperref\pd1
enc.def")[] 

Overfull \hbox (42.41135pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\00miktex\hyp
erref.cfg"))[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\hyperref\hpd
ftex.def"[] 

Overfull \hbox (76.90375pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\oberdiek\rer
unfilecheck.sty"))[] 

Overfull \hbox (59.65755pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\attachfile\a
ttachfile.sty")[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_
blog\processes\proces[] 

Overfull \hbox (48.16008pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ses.aux) ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\bas
e\ts1cmr.fd")[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\context\base\supp-
pdf.mkii"[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_
blog\processes\proces[] 

Overfull \hbox (76.90375pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ses.pyg) ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\hyp
erref\nameref.sty"[] 

Overfull \hbox (88.40121pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\generic\oberdiek\g
ettitlestring.sty"))[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_
blog\processes\proces[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_
blog\processes\proces[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_
blog\processes\proces[] 

Overfull \hbox (36.66261pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ses.toc) ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\lm\
ot1lmr.fd")[] 
[3]
Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\wasysym\uwas
y.fd")[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsfonts\ums
a.fd")[] 

Overfull \hbox (7.91895pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\amsfonts\ums
b.fd")[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Package natbib Warning: Citation `aarik-1997-effec-tio2' o
n page 1 undefined on[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_
blog\processes\proces[] 

Overfull \hbox (59.65755pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ses.out.pyg ("C:\Program Files (x86)\MiKTeX 2.9\tex\latex\
lm\t1lmtt.fd"))[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-
jkitchin.github.com\_[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 Babel <v3.8m> and hyphenation pattern
s for english, afrika[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (88.40121pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 abic, armenian, assamese, basque, ben
gali, bokmal, bulgari[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 croatian, czech, danish, dutch, esper
anto, estonian, farsi[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 lician, german, german-x-2012-05-30, 
greek, gujarati, hind[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ic, indonesian, interlingua, irish, i
talian, kannada, kurm[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (88.40121pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 [] \T1/lmtt/m/n/10.95 lithuanian, malayalam, marathi, mong
olian, mongolianlmc,[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 german-x-2012-05-30, nynorsk, oriya, 
panjabi, pinyin, poli[] 
[4]
Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ian, russian, sanskrit, serbian, slov
ak, slovenian, spanis[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 an, tamil, telugu, turkish, turkmen, 
ukenglish, ukrainian,[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (2.17021pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\base\article[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (42.41135pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 Document Class: article 2007/10/19 v1
.4h Standard LaTeX do[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\base\size11.[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\base\inputen[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\base\latin1.[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (2.17021pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\base\fontenc[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (2.17021pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\base\t1enc.d[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (13.66768pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\base\fixltx2[] 
[5]
Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (30.91388pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\graphics\gra[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\graphics\key[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (30.91388pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\graphics\gra[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (13.66768pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\graphics\tri[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (36.66261pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\00miktex\gra[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (30.91388pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\pdftex-def\p[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (53.90881pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\oberdiek\i[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (59.65755pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\oberdiek\l[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\tools\longta[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (2.17021pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\float\float.[] 
[6]
Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\wrapfig\wrap[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (30.91388pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\rotating\rot[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\base\ifthen.[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (19.41641pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\amsmath\amsm[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (19.41641pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\amsmath\amst[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\amsmath\amsg[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (19.41641pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\amsmath\amsb[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\amsmath\amso[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\base\textcom[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\base\ts1enc.[] 
[7]
Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (36.66261pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\marvosym\mar[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\wasysym\wasy[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\amsfonts\ams[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (42.41135pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\amsfonts\ams[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\mhchem\mhche[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\oberdiek\two[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (53.90881pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\oberdiek\p[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (48.16008pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\oberdiek\i[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (42.41135pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\oberdiek\i[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (13.66768pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\natbib\natbi[] 
[8]
Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\achemso\natm[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (2.17021pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\ltxmisc\url.[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\minted\minte[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (30.91388pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\fancyvrb\fan[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (88.40121pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 Style option: `fancyvrb' v2.7a, with 
DG/SPQR fixes, and fi[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\xcolor\xcolo[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\00miktex\col[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (53.90881pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\ifplatform\i[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (48.16008pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\oberdiek\c[] 

Overfull \hbox (30.91388pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (640.27963pt too wide) in paragraph at line
s 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\oberdiek\e[] 
[9]
Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 texcmds.sty"))))Could Not Find c:\Users\jkitchin\Dropbox\b
logofile-jkitchin.git[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (686.2695pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 c:\Users\jkitchin\Dropbox\blogofile-j
kitchin.github.com\_b[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 log\processes>set  /p x=c:\Users\jkitchin\AppData\Local\En
thought\Canopy\User\S[] 

Overfull \hbox (30.91388pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (249.36575pt too wide) in paragraph at line
s 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 c:\Users\jkitchin\Dropbox\blogofile-j
kitchin.github.com\_b[] 

Overfull \hbox (30.91388pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (249.36575pt too wide) in paragraph at line
s 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 c:\Users\jkitchin\Dropbox\blogofile-j
kitchin.github.com\_b[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (59.65755pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\underscore\u[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (30.91388pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\hyperref\hyp[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (82.65248pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\oberdiek\h[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (88.40121pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\oberdiek\h[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (36.66261pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\ifxetex\if[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (30.91388pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\oberdiek\aux[] 
[10]
Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (42.41135pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\oberdiek\kvo[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\hyperref\pd1[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (42.41135pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\00miktex\hyp[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\hyperref\hpd[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (76.90375pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\oberdiek\rer[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (59.65755pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\attachfile\a[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (25.16515pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\context\base\supp-[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-
jkitchin.github.com\_[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (76.90375pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ses.pyg) ("C:\Program Files (x86)\MiK
TeX 2.9\tex\latex\hyp[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (88.40121pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\generic\oberdiek\g[] 
[11]
Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\wasysym\uwas[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\amsfonts\ums[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (7.91895pt too wide) in paragraph at lines 
180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 ("C:\Program Files (x86)\MiKTeX 2.9\t
ex\latex\amsfonts\ums[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 Package natbib Warning: Citation `aar
ik-1997-effec-tio2' o[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-
jkitchin.github.com\_[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (13.66768pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 Package rerunfilecheck Warning: File 
`processes.out' has c[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (88.40121pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 LaTeX Warning: Label(s) may have chan
ged. Rerun to get cro[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 [] \T1/lmtt/m/n/10.95 ){C:/Program Files (x86)/MiKTeX 2.9/
fonts/enc/dvips/lm/lm[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 iles (x86)/MiKTeX 2.9/fonts/type1/pub
lic/lm/lmbx12.pfb><C:[] 

Overfull \hbox (25.16515pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (94.14995pt too wide) in paragraph at lines
 180--180[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 MiKTeX 2.9/fonts/type1/public/lm/lmbx
8.pfb><C:/Program Fil[] 
[12]
Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_
blog\processes\proces[] 

Overfull \hbox (19.41641pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 Overfull \hbox (2.17021pt too wide) in paragraph at lines 
193--193[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 []\T1/lmtt/m/n/10.95 I found no \bibstyle command---while 
reading file processe[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_
blog\processes\proces[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_
blog\processes\proces[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 (see the transcript file for additional information){C:/Pr
ogram Files (x86)/MiK[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 TeX 2.9/fonts/enc/dvips/lm/lm-ec.enc}<C:/Program Files (x8
6)/MiKTeX 2.9/fonts/t[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 ype1/public/lm/lmbx10.pfb><C:/Program Files (x86)/MiKTeX 2
.9/fonts/type1/public[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 /lm/lmbx12.pfb><C:/Program Files (x86)/MiKTeX 2.9/fonts/ty
pe1/public/lm/lmbx8.p[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 fb><C:/Program Files (x86)/MiKTeX 2.9/fonts/type1/public/l
m/lmr10.pfb><C:/Progr[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 am Files (x86)/MiKTeX 2.9/fonts/type1/public/lm/lmr6.pfb><
C:/Program Files (x86[] 

Overfull \hbox (94.14995pt too wide) in paragraph at lines 541--541
[]\T1/lmtt/m/n/10.95 )/MiKTeX 2.9/fonts/type1/public/lm/lmtt10.pfb><C:/Program 
Files (x86)/MiKTeX 2.[] 

(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.out.pyg)
(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.out.pyg) [13]

Package natbib Warning: Citation `bad-citation' on page 14 undefined on input l
ine 575.


(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.bbl)

Package natbib Warning: There were undefined citations.

[14]
(c:\Users\jkitchin\Dropbox\blogofile-jkitchin.github.com\_blog\processes\proces
ses.aux) )
(see the transcript file for additional information){C:/Program Files (x86)/MiK
TeX 2.9/fonts/enc/dvips/lm/lm-ec.enc}<C:/Program Files (x86)/MiKTeX 2.9/fonts/t
ype1/public/lm/lmbx10.pfb><C:/Program Files (x86)/MiKTeX 2.9/fonts/type1/public
/lm/lmbx12.pfb><C:/Program Files (x86)/MiKTeX 2.9/fonts/type1/public/lm/lmbx8.p
fb><C:/Program Files (x86)/MiKTeX 2.9/fonts/type1/public/lm/lmr10.pfb><C:/Progr
am Files (x86)/MiKTeX 2.9/fonts/type1/public/lm/lmr6.pfb><C:/Program Files (x86
)/MiKTeX 2.9/fonts/type1/public/lm/lmr8.pfb><C:/Program Files (x86)/MiKTeX 2.9/
fonts/type1/public/lm/lmri10.pfb><C:/Program Files (x86)/MiKTeX 2.9/fonts/type1
/public/lm/lmtt10.pfb><C:/Program Files (x86)/MiKTeX 2.9/fonts/type1/public/lm/
lmtt8.pfb>
Output written on processes.pdf (14 pages, 233511 bytes).
Transcript written on processes.log.
#+end_example



#+BEGIN_SRC emacs-lisp
(shell-command-to-string "bibtex processes")
#+END_SRC

#+RESULTS:
: This is BibTeX, Version 0.99d (MiKTeX 2.9)
: The top-level auxiliary file: processes.aux
: The style file: unsrt.bst
: Database file #1: test.bib


Illegal end of database file---line 25 of file test.bib

** Call process

$sin()

\( sin

#+BEGIN_SRC emacs-lisp
(defun pdflatex ()
  (interactive)
  (save-window-excursion
    (let ((basename "processes"))
    (call-process "pdflatex" nil "*pdflatex*" t "-shell-escape" "-interaction" "nonstopmode" basename)) 
    (switch-to-buffer-other-window "*pdflatex*")
    (end-of-buffer)
    (occur "Warning\\|undefined\||error")
    (when (not (y-or-n-p "Continue?"))
(message "killing buffers") 
      (kill-buffer "*pdflatex*") 
      (kill-buffer "*Occur*"))))
#+END_SRC

#+RESULTS:
: pdflatex

see \ref{silly}.

#+BEGIN_SRC emacs-lisp
(defun bibtex ()
  (interactive)
  (save-window-excursion
    (call-process "bibtex8" nil "*bibtex*" t "processes") 
    (switch-to-buffer-other-window "*bibtex*")
    (end-of-buffer)
    (occur "Warning\\|error")
    (when (y-or-n-p "Continue?") 
      (kill-buffer "*bibtex*") 
      (kill-buffer "*Occur*"))))
#+END_SRC



cite:bad-citation

bibliographystyle:unsrt
bibliography:test.bib
